aaron-bond.better-comments@3.0.2
akamud.vscode-theme-onelight@2.3.0
aksharpatel47.vscode-flutter-helper@0.2.5
alefragnani.project-manager@12.8.0
alexisvt.flutter-snippets@3.0.0
amazonwebservices.aws-toolkit-vscode@3.72.0
anseki.vscode-color@0.4.5
chakrounanas.turbo-console-log@3.5.0
christian-kohler.path-intellisense@2.10.0
circlecodesolution.ccs-flutter-color@2.0.0
codezombiech.gitignore@0.10.0
dart-code.dart-code@3.116.0
dart-code.flutter@3.116.0
dbaeumer.vscode-eslint@3.0.16
donjayamanne.githistory@0.6.20
donjayamanne.python-environment-manager@1.2.7
donjayamanne.python-extension-pack@1.7.0
eamodio.gitlens@17.4.1
esbenp.prettier-vscode@11.0.0
fehey.brackets-light-pro@0.4.6
figma.figma-vscode-extension@0.4.1
formulahendry.auto-rename-tag@0.1.10
frhtylcn.pythonsnippets@1.0.2
github.copilot@1.350.0
github.copilot-chat@0.28.5
github.copilot-labs@0.17.1121
github.github-vscode-theme@6.3.5
github.vscode-pull-request-github@0.112.0
gmlewis-vscode.flutter-stylizer@0.1.16
google.gemini-cli-vscode-ide-companion@0.1.21
google.geminicodeassist@2.47.0
googlecloudtools.cloudcode@2.36.0
gornivv.vscode-flutter-files@4.9.1
grapecity.gc-excelviewer@4.2.64
hbenl.vscode-test-explorer@2.22.1
hirantha.json-to-dart@3.5.8
hzgood.dart-data-class-generator@0.5.4
irongeek.vscode-env@0.1.0
jeroen-meijer.pubspec-assist@2.3.2
kamikillerto.vscode-colorize@0.17.1
kimseungtae.aicodehelper@0.0.103
localizely.flutter-intl@1.19.3
marcelovelasquez.flutter-tree@1.0.0
mariomatheu.syntax-project-pbxproj@0.1.3
mechatroner.rainbow-csv@3.20.0
mhutchie.git-graph@1.30.0
mikestead.dotenv@1.0.1
ms-azuretools.vscode-containers@2.1.0
ms-azuretools.vscode-docker@2.0.0
ms-ceintl.vscode-language-pack-ko@1.103.2025081309
ms-edgedevtools.vscode-edge-devtools@2.1.9
ms-kubernetes-tools.vscode-kubernetes-tools@1.3.25
ms-python.debugpy@2025.10.0
ms-python.python@2025.12.0
ms-python.vscode-pylance@2025.7.1
ms-python.vscode-python-envs@1.2.0
ms-vscode-remote.remote-containers@0.422.1
ms-vscode.cmake-tools@1.21.36
ms-vscode.cpptools@1.26.3
ms-vscode.cpptools-extension-pack@1.3.1
ms-vscode.cpptools-themes@2.0.0
ms-vscode.powershell@2025.2.0
ms-vscode.test-adapter-converter@0.2.1
nash.awesome-flutter-snippets@4.0.1
oleg-shilo.cs-script@2.3.0
pflannery.vscode-versionlens@1.22.2
pkief.material-icon-theme@5.26.0
redhat.java@1.44.0
redhat.vscode-yaml@1.18.0
rodrigorahman.flutter-dart-utils@1.8.7
rogalmic.bash-debug@0.3.9
sdras.night-owl@2.1.1
styled-components.vscode-styled-components@1.7.8
twxs.cmake@0.0.17
usernamehw.errorlens@3.26.0
vincaslt.highlight-matching-tag@0.11.0
visualstudioexptteam.intellicode-api-usage-examples@0.2.9
visualstudioexptteam.vscodeintellicode@1.3.2
vscjava.vscode-gradle@3.16.4
vscjava.vscode-java-debug@0.58.2
vscjava.vscode-java-dependency@0.24.1
vscjava.vscode-java-pack@0.29.2
vscjava.vscode-java-test@0.43.1
vscjava.vscode-maven@0.44.0
vscodevim.vim@1.25.2
wallabyjs.console-ninja@1.0.468
welltestedai.fluttergpt@0.5.2
wholroyd.jinja@0.0.8
zhuangtongfa.material-theme@3.19.0
ziyasal.vscode-open-in-github@1.3.6